xfire-core/src/test/org/codehaus/xfire/addressing/testcases/notify/soap12/message1.xml

<?xml version='1.0' ?>
<!-- $Id$ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <env:Header>
  <wsa:Action>http://example.org/action/notify</wsa:Action>
  <wsa:MessageID>urn:uuid:279372E6-3CD2-11DA-9ADE-001124761548</wsa:MessageID>
 </env:Header>
 <env:Body>
  <m:notify xmlns:m="http://example.org/notify">Message 1</m:notify>
 </env:Body>
</env:Envelope>
